#process vendor data
terr_dict = {
    1703: 'Андижанская область',
    1706: 'Бухарская область',
    1730: 'Ферганская область',
    1708: 'Джизакская область',
    1735: 'Республика Каракалпакстан',
    1710: 'Кашкадарьинская область',
    1733: 'Хорезмская область',
    1714: 'Наманганская область',
    1712: 'Навоийская область',
    1718: 'Самаркандская область',
    1724: 'Сирдарьинская область',
    1722: 'Сурхандарьинская область',
    1726: 'Город Ташкент',
    1727: 'Ташкентская область',
}

month_dict = {
    1: 'Январь',
    2: 'Февраль',
    3: 'Март',
    4: 'Апрель',
    5: 'Май',
    6: 'Июнь',
    7: 'Июль',
    8: 'Август',
    9: 'Сентябрь',
    10: 'Октябрь',
    11: 'Ноябрь',
    12: 'Декабрь'
}

proc_dict = {
    3: 'Сделка совершенная',
    6: 'Электронный каталог',
    17: 'Тендер',
    18: 'Конкурс',
    19: 'Прямые договора'
}

etp_dict = {
    1: 'UZEX',
    2: 'XT-XARID',
    3: 'SHAFFOF QURILISH'
}